{"recipes":[{"title":"kapusta","imageUrl":"","source":"","ingredients":"","directions":"","id":"kapusta"},{"title":"Soy-Glazed Meatloaves with Wasabi Mashed Potatoes & Roasted Carrots","imageUrl":"https://www.themealdb.com/images/media/meals/o2wb6p1581005243.jpg","source":"","ingredients":"Potatoes: 5\nCarrots: 12 ounces\nScallions: 1\nGarlic: 2 cloves\nBread: 1 Slice\nGarlic Powder: 1\nSoy Sauce: 2\nGround Beef: 1\nVegetable Oil: 1 tsp \nSugar: 2 tsp\nButter: 2 tbsp","directions":"1. Preheat oven to 425 degrees. Wash and dry all produce. Dice potatoes into 1/2-inch pieces. Trim, peel, and cut carrots on a diagonal into 1/2-inch-thick pieces. Trim and thinly slice scallions, separating whites from greens; finely chop whites. Peel and finely chop garlic.\r\n\r\n2. In a medium bowl, soak bread with 2 TBSP water (4 TBSP for 4 servings); break up with your hands until pasty. Stir in beef, sriracha, scallion whites, half the garlic, salt (we used 3/4 tsp kosher salt; 11/2 tsp for 4), and pepper. Form into two 1-inch-tall loaves (four loaves for 4). Place on one side of a baking sheet. Toss carrots on empty side of same sheet with a drizzle of oil, salt, and pepper. (For 4, spread meatloaves out across whole sheet and add carrots to a second sheet.) Bake for 20 minutes (we'll glaze the meatloaves then).\r\n\r\n3. Meanwhile, place potatoes in a medium pot with enough salted water to cover by 2 inches. Bring to a boil and cook until very\r\ntender, 12-15 minutes. Reserve 1/2 cup potato cooking liquid, then drain. While potatoes cook, in a small bowl, combine soy sauce, garlic powder, 1/4 cup ketchup (1/2 cup for 4 servings), and 2 tsp sugar (4 tsp for 4).\r\n\r\n4. Once meatloaves and carrots have baked 20 minutes, remove from oven. Spoon half the ketchup glaze over meatloaves (save\r\nthe rest for serving); return to oven until carrots are browned and tender, meatloaves are cooked through, and glaze is tacky, 4-5 minutes more.\r\n\r\n5. Meanwhile, melt 2 TBSP butter (4 TBSP for 4 servings) in pot used for potatoes over medium heat. Add remaining garlic and cook\r\nuntil fragrant, 30 seconds. Add potatoes and 1/4 tsp wasabi. Mash, adding splashes of reserved potato cooking liquid as necessary until smooth. Season with salt and pepper. (If you like things spicy, stir in more wasabi!)\r\n\r\n6. Divide meatloaves, mashed potatoes, and roasted carrots between plates. Sprinkle with scallion greens and serve with remaining ketchup glaze on the side for dipping.","id":"Soy-Glazed-Meatloaves-with-Wasabi-Mashed-Potatoes-&-Roasted-Carrots"},{"title":"Burak z Jaśkiem","imageUrl":"https://images.squarespace-cdn.com/content/v1/5004f0c084ae0994a1463cc5/1443386174873-7NIMXCYAFXPBQUFYFRZT/image-asset.jpeg?format=2500w","source":"https://jolascooking.com/przepisy/2015/9/27/burak-z-jakiem","ingredients":"3 średnie, ugotowane lub upieczone buraki*\n3 średnie ziemniaki sałatkowe, ugotowane w łupinach\n2 szklanki ugotowanej fasoli Jasiek lub innej dużej, białej fasoli\n2 ogórki kiszone (mogą być konserwowe jeśli nie mamy kiszonych)\n1 mała cebula\ngarść posiekanej natki pietruszki\n4 łyżki oliwy z oliwek\n1 łyżka octu jabłkowego\nsól\npieprz","directions":"*Pieczone buraki. Buraki (średniej wielkości) dokładnie myjemy, zawijamy pojedynczo w folię aluminiową i pieczemy w piekarniku nagrzanym do 190° C przez 1,5 - 2 godziny.\n\nZiemniaki i buraki obieramy i kroimy w kostkę jak do sałatki warzywnej.\nCebulę obieramy i bardzo drobno siekamy w kostkę.\nOgórki kiszone kroimy w kostkę i odciskamy nadmiar soku.\nPokrojone warzywa wrzucamy do miski, dodajemy fasolę, oliwę, ocet jabłkowy i posiekaną natkę pietruszki. Doprawiamy solą i pieprzem i dokładnie mieszamy.\nSałatkę odstawiamy do lodówki na co najmniej godzinę. \nPrzed podaniem sprawdzamy, czy nie trzeba sałatki jeszcze raz doprawić.","id":"Burak-z-Jaśkiem"},{"title":"Cream Cheese Tart","imageUrl":"https://www.themealdb.com/images/media/meals/wurrux1468416624.jpg","source":"https://www.youtube.com/watch?v=UhQPwO4uymo","ingredients":"Flour: 250g\nButter: 125g\nEgg: 1\nSalt: Pinch\nCheese: 300g\nMilk: 100ml milk\nEggs: 3\nParmesan Cheese: 100g\nPlum tomatoes: 350g\nWhite Vinegar: 3tbsp\nHoney: 1 tbsp\nBasil: Topping","directions":"Crust: make a dough from 250g flour (I like mixing different flours like plain and wholegrain spelt flour), 125g butter, 1 egg and a pinch of salt, press it into a tart form and place it in the fridge. Filling: stir 300g cream cheese and 100ml milk until smooth, add in 3 eggs, 100g grated parmesan cheese and season with salt, pepper and nutmeg. Take the crust out of the fridge and prick the bottom with a fork. Pour in the filling and bake at 175 degrees C for about 25 minutes. Cover the tart with some aluminium foil after half the time. In the mean time, slice about 350g mini tomatoes. In a small pan heat 3tbsp olive oil, 3tbsp white vinegar, 1 tbsp honey, salt and pepper and combine well. Pour over the tomato slices and mix well. With a spoon, place the tomato slices on the tart, avoiding too much liquid on it. Decorate with basil leaves and enjoy","id":"Cream-Cheese-Tart"},{"title":"Creamy Tomato Soup","imageUrl":"https://www.themealdb.com/images/media/meals/stpuws1511191310.jpg","source":"https://www.youtube.com/watch?v=lBhwjjUiFk4","ingredients":"Olive Oil: 3 tbsp\nOnions: 2 chopped\nCelery: 2 sticks\nCarrots: 300g\nPotatoes: 500g\nBay Leaf: 4\nTomato Puree: 5 tblsp \nSugar: 2 tblsp \nWhite Vinegar: 2 tblsp \nChopped Tomatoes: 1½ kg\nPassata: 500g\nVegetable Stock Cube: 3\nWhole Milk: 400ml","directions":"Put the oil, onions, celery, carrots, potatoes and bay leaves in a big casserole dish, or two saucepans. Fry gently until the onions are softened – about 10-15 mins. Fill the kettle and boil it.\r\nStir in the tomato purée, sugar, vinegar, chopped tomatoes and passata, then crumble in the stock cubes. Add 1 litre boiling water and bring to a simmer. Cover and simmer for 15 mins until the potato is tender, then remove the bay leaves. Purée with a stick blender (or ladle into a blender in batches) until very smooth. Season to taste and add a pinch more sugar if it needs it. The soup can now be cooled and chilled for up to 2 days, or frozen for up to 3 months.\r\nTo serve, reheat the soup, stirring in the milk – try not to let it boil. Serve in small bowls with cheesy sausage rolls.","id":"Creamy-Tomato-Soup"},{"title":"Jerk chicken with rice & peas","imageUrl":"https://www.themealdb.com/images/media/meals/tytyxu1515363282.jpg","source":"https://www.youtube.com/watch?v=qfchrS2D_v4","ingredients":"Chicken Thighs: 12\nLime: 1/2 \nSpring Onions: 1  bunch\nGinger: 1 tbs chopped\nGarlic: 3 cloves\nOnion: 1/2 \nRed Chilli: 3 chopped\nThyme: 1/2 teaspoon\nLime: Juice of 1\nSoy Sauce: 2 tbs\nVegetable Oil: 2 tbs\nBrown Sugar: 3 tbs\nAllspice: 1 tbs\nBasmati Rice: 200g\nCoconut Milk: 400g\nSpring Onions: 1  bunch\nThyme: 2 sprigs\nGarlic: 2 cloves chopped\nAllspice: 1 tbs\nKidney Beans: 800g","directions":"To make the jerk marinade, combine all the ingredients in a food processor along with 1 tsp salt, and blend to a purée. If you’re having trouble getting it to blend, just keep turning off the blender, stirring the mixture, and trying again. Eventually it will start to blend up – don’t be tempted to add water, as you want a thick paste.\r\n\r\nTaste the jerk mixture for seasoning – it should taste pretty salty, but not unpleasantly, puckering salty. You can now throw in more chillies if it’s not spicy enough for you. If it tastes too salty and sour, try adding in a bit more brown sugar until the mixture tastes well balanced.\r\n\r\nMake a few slashes in the chicken thighs and pour the marinade over the meat, rubbing it into all the crevices. Cover and leave to marinate overnight in the fridge.\r\n\r\nIf you want to barbecue your chicken, get the coals burning 1 hr or so before you’re ready to cook. Authentic jerked meats are not exactly grilled as we think of grilling, but sort of smoke-grilled. To get a more authentic jerk experience, add some wood chips to your barbecue, and cook your chicken over slow, indirect heat for 30 mins. To cook in the oven, heat to 180C/160C fan/gas 4. Put the chicken pieces in a roasting tin with the lime halves and cook for 45 mins until tender and cooked through.\r\n\r\nWhile the chicken is cooking, prepare the rice & peas. Rinse the rice in plenty of cold water, then tip it into a large saucepan with all the remaining ingredients except the kidney beans. Season with salt, add 300ml cold water and set over a high heat. Once the rice begins to boil, turn it down to a medium heat, cover and cook for 10 mins.\r\n\r\nAdd the beans to the rice, then cover with a lid. Leave off the heat for 5 mins until all the liquid is absorbed. Squeeze the roasted lime over the chicken and serve with the rice & peas, and some hot sauce if you like it really spicy.","id":"Jerk-chicken-with-rice-&-peas"},{"title":"edded","imageUrl":"","source":"","ingredients":"","directions":"","id":"edded"},{"title":"Beef Lo Mein","imageUrl":"https://www.themealdb.com/images/media/meals/1529444830.jpg","source":"https://www.youtube.com/watch?v=ZT9LSsNXXe0","ingredients":"Beef: 1/2 lb\nSalt: pinch\nPepper: pinch\nSesame Seed Oil: 2 tsp\nEgg: 1/2 \nStarch: 3 tbs\nOil: 5 tbs\nNoodles: 1/4 lb\nOnion: 1/2 cup \nMinced Garlic: 1 tsp \nGinger: 1 tsp \nBean Sprouts: 1 cup \nMushrooms: 1 cup \nWater: 1 cup \nOyster Sauce: 1 tbs\nSugar: 1 tsp \nSoy Sauce: 1 tsp ","directions":"STEP 1 - MARINATING THE BEEF\r\nIn a bowl, add the beef, salt, 1 pinch white pepper, 1 Teaspoon sesame seed oil, 1/2 egg, corn starch,1 Tablespoon of oil and mix together.\r\nSTEP 2 - BOILING THE THE NOODLES\r\nIn a 6 qt pot add your noodles to boiling water until the noodles are submerged and boil on high heat for 10 seconds. After your noodles is done boiling strain and cool with cold water.\r\nSTEP 3 - STIR FRY\r\nAdd 2 Tablespoons of oil, beef and cook on high heat untill beef is medium cooked.\r\nSet the cooked beef aside\r\nIn a wok add 2 Tablespoon of oil, onions, minced garlic, minced ginger, bean sprouts, mushrooms, peapods and 1.5 cups of water or until the vegetables are submerged in water.\r\nAdd the noodles to wok\r\nTo make the sauce, add oyster sauce, 1 pinch white pepper, 1 teaspoon sesame seed oil, sugar, and 1 Teaspoon of soy sauce.\r\nNext add the beef to wok and stir-fry","id":"Beef-Lo-Mein"},{"title":"Banana Pancakes","imageUrl":"https://www.themealdb.com/images/media/meals/sywswr1511383814.jpg","source":"https://www.youtube.com/watch?v=kSKtb2Sv-_U","ingredients":"Banana: 1 large\nEggs: 2 medium\nBaking Powder: pinch\nVanilla Extract: spinkling\nOil: 1 tsp \nPecan Nuts: 25g\nRaspberries: 125g","directions":"In a bowl, mash the banana with a fork until it resembles a thick purée. Stir in the eggs, baking powder and vanilla.\r\nHeat a large non-stick frying pan or pancake pan over a medium heat and brush with half the oil. Using half the batter, spoon two pancakes into the pan, cook for 1-2 mins each side, then tip onto a plate. Repeat the process with the remaining oil and batter. Top the pancakes with the pecans and raspberries.","id":"Banana-Pancakes"},{"title":"Beef Banh Mi Bowls with Sriracha Mayo, Carrot & Pickled Cucumber","imageUrl":"https://www.themealdb.com/images/media/meals/z0ageb1583189517.jpg","source":"","ingredients":"Rice: White\nOnion: 1\nLime: 1\nGarlic Clove: 3\nCucumber: 1\nCarrots: 3 oz \nGround Beef: 1 lb\nSoy Sauce: 2 oz ","directions":"Add'l ingredients: mayonnaise, siracha\r\n\r\n1\r\n\r\nPlace rice in a fine-mesh sieve and rinse until water runs clear. Add to a small pot with 1 cup water (2 cups for 4 servings) and a pinch of salt. Bring to a boil, then cover and reduce heat to low. Cook until rice is tender, 15 minutes. Keep covered off heat for at least 10 minutes or until ready to serve.\r\n\r\n2\r\n\r\nMeanwhile, wash and dry all produce. Peel and finely chop garlic. Zest and quarter lime (for 4 servings, zest 1 lime and quarter both). Trim and halve cucumber lengthwise; thinly slice crosswise into half-moons. Halve, peel, and medium dice onion. Trim, peel, and grate carrot.\r\n\r\n3\r\n\r\nIn a medium bowl, combine cucumber, juice from half the lime, ¼ tsp sugar (½ tsp for 4 servings), and a pinch of salt. In a small bowl, combine mayonnaise, a pinch of garlic, a squeeze of lime juice, and as much sriracha as you’d like. Season with salt and pepper.\r\n\r\n4\r\n\r\nHeat a drizzle of oil in a large pan over medium-high heat. Add onion and cook, stirring, until softened, 4-5 minutes. Add beef, remaining garlic, and 2 tsp sugar (4 tsp for 4 servings). Cook, breaking up meat into pieces, until beef is browned and cooked through, 4-5 minutes. Stir in soy sauce. Turn off heat; taste and season with salt and pepper.\r\n\r\n5\r\n\r\nFluff rice with a fork; stir in lime zest and 1 TBSP butter. Divide rice between bowls. Arrange beef, grated carrot, and pickled cucumber on top. Top with a squeeze of lime juice. Drizzle with sriracha mayo.","id":"Beef-Banh-Mi-Bowls-with-Sriracha-Mayo,-Carrot-&-Pickled-Cucumber"},{"title":"Gołąbki (cabbage roll)","imageUrl":"https://www.themealdb.com/images/media/meals/q8sp3j1593349686.jpg","source":"https://www.youtube.com/watch?v=rBrTkDdoPYg","ingredients":"Cabbage: 1\nButter: 2 tbs\nOnion: 1 chopped\nGround Beef: 1 lb\nGround Pork: 1/2 lb\nRice: 1 1/2 cups \nGarlic: 1 tsp \nSalt: 1 tsp \nBlack Pepper: 1/4 tsp\nTomato Puree: 3 cans","directions":"Bring a large pot of lightly salted water to a boil. Place cabbage head into water, cover pot, and cook until cabbage leaves are slightly softened enough to remove from head, 3 minutes. Remove cabbage from pot and let cabbage sit until leaves are cool enough to handle, about 10 minutes.\r\n\r\nRemove 18 whole leaves from the cabbage head, cutting out any thick tough center ribs. Set whole leaves aside. Chop the remainder of the cabbage head and spread it in the bottom of a casserole dish.\r\n\r\nMelt butter in a large skillet over medium-high heat. Cook and stir onion in hot butter until tender, 5 to 10 minutes. Cool.\r\n\r\nStir onion, beef, pork, rice, garlic, 1 teaspoon salt, and 1/4 teaspoon pepper together in a large bowl.\r\n\r\nPreheat oven to 350 degrees F (175 degrees C).\r\n\r\nPlace about 1/2 cup beef mixture on a cabbage leaf. Roll cabbage around beef mixture, tucking in sides to create an envelope around the meat. Repeat with remaining leaves and meat mixture. Place cabbage rolls in a layer atop the chopped cabbage in the casserole dish; season rolls with salt and black pepper.\r\n\r\nWhisk tomato soup, tomato juice, and ketchup together in a bowl. Pour tomato soup mixture over cabbage rolls and cover dish wish aluminum foil.\r\n\r\nBake in the preheated oven until cabbage is tender and meat is cooked through, about 1 hour.","id":"Gołąbki-(cabbage-roll)"},{"title":"SER ZAPIEKANY Z JAJKAMI","imageUrl":"https://filozofiasmaku.pl/wp-content/uploads/2021/04/Jajka-zapiekane-z-feta.jpg","source":"https://filozofiasmaku.pl/2021/04/25/ser-zapiekany-z-jajkami-pomysl-na-efektowne-i-proste-sniadanie/","ingredients":"Składniki (na 2 albo 3 porcje):\n\n100 g sera sirene (opcjonalnie feta, jeśli nie uda się kupić sirene)\nPół czerwonej papryki, pokrojonej w kawałki\n2 słodkie i dojrzałe pomory obrane ze skórki lub siekane pomidory z kartonika (300 g)\n1 ząbek czosnku, przeciśnięty przez praskę (opcjonalnie)\nSól i świeżo mielony pieprz do smaku\n2 jajka\nPosiekana natka pietruszki do posypania","directions":"W dwóch niedużych naczynkach żaroodpornych umieszczamy ser w kawałku. Na wierzchu układamy paprykę, pomidory, posypujemy solą i pieprzem (uważamy na ilość soli, bo ser jest słony), czosnkiem.\nNaczynka przykrywamy, wstawiamy do piekarnika nagrzanego do 180 stopni (grzałka góra-dół) i pieczemy przez 30-40 minut.\nNaczynka odkrywamy, do każdego wbijamy po 1 jajku. Oprószamy je delikatnie solą. Naczynka wkładamy z powrotem do piekarnika i pieczemy przez około 12-15 minut lub dłużej do preferowanego ścięcia żółtka. Danie posypujemy posiekaną natką pietruszki. Podajemy od razu po przygotowaniu z dodatkiem pieczywa, np. chlebka lepinja.","id":"SER-ZAPIEKANY-Z-JAJKAMI"},{"title":"pasteis de belen","imageUrl":"https://www.livingtours.com/public/blog/posts/20200123161347-reQkxvU6.jpg","source":"","ingredients":"2 płaty ciasta francuskiego na maśle (2 opakowania po ok. 300 g ciasta)\n3 łyżki mąki pszennej\n1 i 1/4 szklanki mleka\n1 szklanka i 2 łyżki cukru\n1 laska cynamonu\n2/3 szklanki wody\n1 łyżeczka ekstraktu z wanilii\n6 dużych żółtek","directions":"Uwaga: 1 szklanka ma pojemność 250 ml, 1 łyżka ma pojemność 15 ml (jak zawsze na Moich Wypiekach).\n\nW miseczce wymieszać rózgą kuchenną 1/4 szklanki mleka z 3 łyżkami przesianej mąki pszennej i wanilią, odłożyć.\n\nW garnuszku zagotować wodę z laską cynamonu i cukrem – doprowadzić do wrzenia i zdjąć z palnika.\n\nW drugim garnuszku zagotować mleko. Wrzącym mlekiem zalać rozprowadzoną makę i wymieszać rózgą kuchenną. Z syropu cukrowego wyjąć cynamon i cały syrop przelać do mleka z mąką, wymieszać.\n\nŻołtka roztrzepać rózgą kuchenną. Dodać do wody i mleka, wymieszać. Przelać do garnuszka i doprowadzić do wrzenia, mieszając, natychmiast zdjąć z palnika (by mieszanka się nie zwarzyła). Odstawić – mieszanka będzie bardzo rzadka, tak ma być.\n\nPrzygotować formę do muffinów – o standardowej wielkości gniazd. Z rozwałkowanego ciasta francuskiego wycinać kółka o średnicy nieco większej niż średnica gniazd, tak by ciasto po wyłożeniu zajęło dno i boki foremek. Do gniazdek z ciasta przelewać mieszankę, nalewając ją do 3/4 wysokości boków ciasta (nie więcej; podczas pieczenia budyń unosi się do góry i gotuje – jeśli nalejecie za dużo, wyleje się ponad foremkę).\n\nPiec w temperaturze 290ºC (tak, tak, naprawdę!) przez około 8-9 minut. Mój piekarnik grzeje maksymalnie do 270ºC więc piekłam w takiej temperaturze, z termoobiegiem, dodatkowo 1 minutę dłużej. Wyjąć z piekarnika, przełożyć na kratkę (uwaga, są bardzo gorące!).\n\nMożna podawać oprószone cynamonem.","id":"pasteis-de-belen"},{"title":"pieczone pierogi","imageUrl":"https://lh5.googleusercontent.com/-clfaodJfqqU/UG378ziIW-I/AAAAAAAAGGs/VxBIL27VHwM/s600/a%2520pierogi%2520pieczone%2520cebularze-8.jpg","source":"http://strawberriesfrompoland.pl/2012/10/09/ps-obiecany-przepis-2/","ingredients":"na ciasto:\n 500 g twarogu (tlustego/półtłustego/chudego, dobrze rozdrobnionego widelcem)\n250 masła bądź margaryny (zimnego)\n500 g mąki pszennej\n2 płaskie łyżeczki soli\nna nadzienie cebulowe z wędzoną papryką:\n4 średnie cebule\n1 łyżeczka wędzonej papryki\n1 łyżka maku\n1 łyżka masła\n1 łyżka oleju\nsól do smaku\nna nadzienie z bakłażana i chilli:\n1 niewielki bakłażan\n3-4 suszone pomidory\n1/2 pokrojonej drobno papryczki chi lii\n1 ząbek czosnku\n2 łyżeczki oleju do smażenia\nsól do smaku\ndo posypania pierożków:\ndowolne zioła lub nasiona\ndo posmarowania pierożków:\n1 jajko","directions":"W robocie kuchennym łączę składniki (bądź mieszam ręcznie). Ciasto powinno być zwarte i elastyczne. Chowam je do lodówki na czas przygotowywania farszu.\nObieram cebulę i kroję ją w piórka. Na patelni rozgrzewam masło i olej, dodaję cebulę, paprykę i solę całość. Duszę na niewielkim ogniu, aż zrobi się szklista. Zdejmuję cebulę z patelni i mieszam z makiem.\nBakłażana kroję w niewielką kostkę, czosnek drobno siekam. Na patelni rozgrzewam tłuszcz i podsmażam bakłażana. Gdy nieco zmięknie, dodaję czosnek, chilli, solę całość i smażę chwilę. Na koniec dodaję pokrojone w paseczki suszone pomidory.\nCiasto na pierogi wałkuję niezbyt cienko, aby nie pękło. Wycinam koła, nakładam do nich porcje farszu i dokładnie zlepiam brzegi. Pierożki układam na wyłożonej papierem do pieczenia blasze. Smaruję rozmąconym jajkiem, posypuję ziołami lub nasionami i piekę ok. 25 minut w temp. 200 st. C.","id":"pieczone-pierogi"},{"title":"Kurczak w czerwonym curry z warzywami i ryżem","imageUrl":"https://a.allegroimg.com/s1024/110618/8955242f4566b8d1c2a28ba17cba/Czerwona-Pasta-Curry-LOBO-Red-Thai-Curry-50-g-Nazwa-handlowa-Czerwona-Pasta-Curry-LOBO-Red-Thai-Curry-50-g","source":"","ingredients":"2 łyżki oleju roślinnego\n2 płaskie łyżeczki czerwonej pasty curry Lobo\n1 duży ząbek czosnku\n1 pojedyncza pierś kurczaka\n1 cebula szalotka (lub 1/2 małej cebuli)\n1/2 czerwonej papryki\n2/3 szklanki zielonej fasolki (może być mrożona)\n200 ml mleka kokosowego\n1 łyżeczka cukru\n1 łyżka sosu rybnego (lub sojowego)","directions":"Mięso kurczaka umyć i oczyścić z błonek, pokroić na ok. 2 cm kawałki. Czosnek pokroić na cienkie plasterki, cebulę w piórka; paprykę oczyścić i pokroić w ok. 2 cm kawałki. Fasolkę podgotować (i też rozmrozić jeśli jest mrożona) na parze, na sitku nad gotującą się wodą na ryż (przykryć wszystko pokrywką, nie musi być idealnie szczelnie), ok. 5 minut.\n\nW woku lub na patelni rozgrzać olej, dodać pastę curry i podsmażyć 30 sekund. Dodać czosnek i podsmażyć kolejne 30 sekund. Dodać kawałki kurczaka i podsmażyć wszystko jeszcze ok. 2 minuty.\n\nDodać cebulą i paprykę i dalej podsmażać przez ok. 2 minuty. Dodać podgotowaną na parze fasolkę, wszystko zalać mlekiem kokosowym. Dodać cukier i sos rybny, wymieszać i gotować wszystko aż sos nieco odparuje (ok. 5-6 minut). Podawać z ryżem jaśminowym i świeżą kolendrą skrapiając sokiem z limonki.","id":"Kurczak-w-czerwonym-curry-z-warzywami-i-ryżem"},{"title":"Pieczone bataty","imageUrl":"https://fotokulinarnie.pl/wp-content/uploads/2015/10/IMG_2751-scaled.jpg","source":"https://fotokulinarnie.pl/pieczone-bataty","ingredients":"1 kg słodkich ziemniaków batatów\n1 i 1/2 łyżki oliwy z oliwek\n3/4 łyżeczki czerwonej słodkiej papryki\n1 łyżeczka soli\n1/3 łyżeczki pieprzu\n1 łyżeczka świeżego lub suszonego tymianku","directions":"batatów nie trzeba obierać, ale jeśli chcecie lub jeśli skórka jest brzydka czy twarda, to oczywiście można. Jeśli jednak ich nie obieracie, to umyć je dokładnie wodą i dokładnie wyszorować skórkę z wszelkich zanieczyszczeń\nbataty pokroić w prostokąty długości ok. 7 cm, a średnicy ok. 2 cm. Ważne by wszystkie kawałki były mniej więcej tej samej wielkości, by równomiernie się upiekły\noliwę dokładnie wymieszać z wszystkimi przyprawami w sporej misce. Do miski wrzucić kawałki batatów i przemieszać tak, by oliwa z przyprawami dokładnie okleiła każdą frytkę\nfrytki rozłożyć równomiernie na blasze wyłożonej papierem do pieczenia\npiec w 200 stopniach przez ok. 25 do 30 min. - jeśli zrobiliście mniejsze frytki, to upieką się szybciej, większe nieco dłużej. Na koniec słodkie ziemniaki powinny być miękkie i przyrumienione\npodawać gorące. Jeśli są za mało słone, dosolić","id":"Pieczone-bataty"},{"title":"KOKOSOWE CURRY Z KREWETKAMI","imageUrl":"https://kuchnialidla.pl/img/PL/1250x700/113627210382-7945f09c9b90-Kokos-Garnelen-Curry.webp","source":"https://kuchnialidla.pl/kokosowe-curry-z-krewetkami","ingredients":"brokuł - 500 g\nbulion warzywny - 150 ml\ncebula - 2 szt.\ncurry - 2 łyżeczki\ncytryna - 1 szt.\npieprz czarny - 1 szczypta\nliść laurowy - 2 szt.\nolej - 2 łyżki\nsól - 1 szczypta\nwiórki kokosowe - 25 g\nmleczko kokosowe - 400 ml\nkrewetki koktajlowe - 600 g\nząbek czosnku - 2 szt.","directions":"KROK 1: BLANSZUJEMY BROKUŁY\nKrewetki płuczemy w zimnej wodzie i pozostawiamy do rozmrożenia. Brokuły oczyszczamy i dzielimy na małe różyczki. Blanszujemy we wrzącej, osolonej wodzie przez 1-2 minuty, odlewamy, przelewamy zimną wodą i osączamy.\n\nKROK 2: PODSMAŻAMY WARZYWA\nCebulę i czosnek obieramy i kroimy w drobną kostkę. Curry i liście laurowe podsmażamy na gorącym oleju przez 1 minutę. Dodajemy cebulę, czosnek oraz wiórki kokosowe i smażymy przez 1 minutę do zeszklenia. Dolewamy mleczko kokosowe i bulion. Doprawiamy solą i pieprzem. Curry redukujemy przez 10 minut. Krewetki osuszamy, doprawiamy solą i sokiem z cytryny.\n\nKROK 3: DODAJEMY KREWETKI I BROKUŁY DO CURRY\nDo sosu dodajemy krewetki oraz różyczki brokułów i całość podgrzewamy przez 3-5 minut. Liście laurowe wyjmujemy. Curry podajemy z ryżem jaśminowym lub basmati.","id":"KOKOSOWE-CURRY-Z-KREWETKAMI"}]}