{"recipes":[{"title":"Honey Teriyaki Salmon","imageUrl":"https://www.themealdb.com/images/media/meals/xxyupu1468262513.jpg","source":"https://www.youtube.com/watch?v=4MpYuaJsvRw","ingredients":"Salmon: 1 lb\nOlive oil: 1 tablespoon\nSoy Sauce: 2 tablespoons\nSake: 2 tablespoons\nSesame Seed: 4 tablespoons","directions":"Mix all the ingredients in the Honey Teriyaki Glaze together. Whisk to blend well. Combine the salmon and the Glaze together.\r\n\r\nHeat up a skillet on medium-low heat. Add the oil, Pan-fry the salmon on both sides until it’s completely cooked inside and the glaze thickens.\r\n\r\nGarnish with sesame and serve immediately.","id":"39e5528e-39db-48db-b15d-d5fa6121eb89","slug":"honey-teriyaki-salmon"},{"title":"General Tso's Chicken","imageUrl":"https://www.themealdb.com/images/media/meals/1529444113.jpg","source":"https://www.youtube.com/watch?v=wWGwz0iBmvU","ingredients":"Chicken Breast: 1 1/2 \nPlain Flour: 3/4 cup \nEgg: 1\nStarch: 2 tbs\nBaking Powder: 1 tbs\nSalt: 1 tsp \nOnion Salt: 1/2 tsp\nGarlic Powder: 1/4 tsp\nWater: 3/4 cup \nChicken Stock: 1/2 cup \nDuck Sauce: 1/4 cup\nSoy Sauce: 3 tbs\nHoney: 2 tbs\nRice Vinegar: 1 tbs\nSesame Seed Oil: 2 tbs\nGochujang: 1/2 tbs\nStarch: 2 tbs\nGarlic: 1 clove\nSpring Onions: 2 chopped\nGinger: 1 tsp ","directions":"DIRECTIONS:\r\nSTEP 1 - SAUCE\r\nIn a bowl, add 2 Cups of water, 2 Tablespoon soy sauce, 2 Tablespoon white vinegar, sherry cooking wine, 1/4 Teaspoon white pepper, minced ginger, minced garlic, hot pepper, ketchup, hoisin sauce, and sugar.\r\nMix together well and set aside.\r\nSTEP 2 - MARINATING THE CHICKEN\r\nIn a bowl, add the chicken, 1 pinch of salt, 1 pinch of white pepper, 2 egg whites, and 3 Tablespoon of corn starch\r\nSTEP 3 - DEEP FRY THE CHICKEN\r\nDeep fry the chicken at 350 degrees for 3-4 minutes or until it is golden brown and loosen up the chicken so that they don't stick together.\r\nSet the chicken aside.\r\nSTEP 4 - STIR FRY\r\nAdd the sauce to the wok and then the broccoli and wait until it is boiling.\r\nTo thicken the sauce, whisk together 2 Tablespoon of cornstarch and 4 Tablespoon of water in a bowl and slowly add to your stir-fry until it's the right thickness.\r\nNext add in the chicken and stir-fry for a minute and serve on a plate","id":"5c4e7b37-b1a7-4de1-98cd-fb11a2e7fdd9","slug":"general-tsos-chicken"},{"title":"Kung Pao Chicken","imageUrl":"https://www.themealdb.com/images/media/meals/1525872624.jpg","source":"https://www.youtube.com/watch?v=QqdcCHQlOe0","ingredients":"Sake: 2 tbs\nSoy Sauce: 2 tbs\nSesame Seed Oil: 2 tbs\nCorn Flour: 2 tbs\nWater: 2 tbs\nChicken: 500g\nChilli Powder: 1 tbs\nRice Vinegar: 1 tsp \nBrown Sugar: 1 tbs\nSpring Onions: 4 Chopped\nGarlic Clove: 6 cloves\nWater Chestnut: 220g\nPeanuts: 100g ","directions":"Combine the sake or rice wine, soy sauce, sesame oil and cornflour dissolved in water. Divide mixture in half.\r\nIn a glass dish or bowl, combine half of the sake mixture with the chicken pieces and toss to coat. Cover dish and place in refrigerator for about 30 minutes.\r\nIn a medium frying pan, combine remaining sake mixture, chillies, vinegar and sugar. Mix together and add spring onion, garlic, water chestnuts and peanuts. Heat sauce slowly over medium heat until aromatic.\r\nMeanwhile, remove chicken from marinade and sauté in a large frying pan until juices run clear. When sauce is aromatic, add sautéed chicken and let simmer together until sauce thickens.","id":"040bf929-6a2d-4ea0-970c-8688d28e9b8e","slug":"kung-pao-chicken"},{"title":"Chicken Enchilada Casserole","imageUrl":"https://www.themealdb.com/images/media/meals/qtuwxu1468233098.jpg","source":"https://www.youtube.com/watch?v=EtVkwVKLc_M","ingredients":"Enchilada sauce: 14 oz jar\nshredded Monterey Jack cheese: 3 Cups\ncorn tortillas: 6\nchicken breasts: 2","directions":"Cut each chicken breast in about 3 pieces, so that it cooks faster and put it in a small pot. Pour Enchilada sauce over it and cook covered on low to medium heat until chicken is cooked through, about 20 minutes. No water is needed, the chicken will cook in the Enchilada sauce. Make sure you stir occasionally so that it doesn't stick to the bottom.\r\nRemove chicken from the pot and shred with two forks.\r\nPreheat oven to 375 F degrees.\r\nStart layering the casserole. Start with about ¼ cup of the leftover Enchilada sauce over the bottom of a baking dish. I used a longer baking dish, so that I can put 2 corn tortillas across. Place 2 tortillas on the bottom, top with ⅓ of the chicken and ⅓ of the remaining sauce. Sprinkle with ⅓ of the cheese and repeat starting with 2 more tortillas, then chicken, sauce, cheese. Repeat with last layer with the remaining ingredients, tortillas, chicken, sauce and cheese.\r\nBake for 20 to 30 minutes uncovered, until bubbly and cheese has melted and started to brown on top.\r\nServe warm.","id":"57a79a94-01d4-40eb-be97-1e4a7648f735","slug":"chicken-enchilada-casserole"},{"title":"Fennel Dauphinoise","imageUrl":"https://www.themealdb.com/images/media/meals/ytttsv1511798734.jpg","source":"https://www.youtube.com/watch?v=tXBzZm2kkh8","ingredients":"Potatoes: 225g\nFennel: 1 small\nGarlic: 1 clove finely chopped\nMilk: 75 ml \nDouble Cream: 100ml\nButter: For Greasing\nParmesan Cheese: to serve","directions":"Heat oven to 180C/160C fan/gas 4. Put potatoes, fennel, and garlic in a medium non-stick pan. Pour in milk and double cream, season well and simmer gently, covered, for 10 mins, stirring halfway through, until potatoes are just tender.\r\nDivide the mixture between 2 small (about 150ml) buttered ramekins and scatter with Parmesan. Bake for 40 mins until the potatoes are golden and tender when pierced with a knife. Snip the reserved fennel fronds over before serving.","id":"5a7bc343-8e01-4784-af8b-a7bdd75febad","slug":"fennel-dauphinoise"}]}