{"recipes":[{"title":"masło (yyy)","imageUrl":"","source":"","ingredients":"","directions":"","id":"mas%C5%82o-(yyy)"},{"title":"dasdsad (maslo)","imageUrl":"","source":"","ingredients":"","directions":"","id":"dasdsad-(maslo)"},{"title":"Beef Banh Mi Bowls with Sriracha Mayo, Carrot & Pickled Cucumber","imageUrl":"https://www.themealdb.com/images/media/meals/z0ageb1583189517.jpg","source":"","ingredients":"Rice: White\nOnion: 1\nLime: 1\nGarlic Clove: 3\nCucumber: 1\nCarrots: 3 oz \nGround Beef: 1 lb\nSoy Sauce: 2 oz ","directions":"Add'l ingredients: mayonnaise, siracha\n\n1\n\nPlace rice in a fine-mesh sieve and rinse until water runs clear. Add to a small pot with 1 cup water (2 cups for 4 servings) and a pinch of salt. Bring to a boil, then cover and reduce heat to low. Cook until rice is tender, 15 minutes. Keep covered off heat for at least 10 minutes or until ready to serve.\n\n2\n\nMeanwhile, wash and dry all produce. Peel and finely chop garlic. Zest and quarter lime (for 4 servings, zest 1 lime and quarter both). Trim and halve cucumber lengthwise; thinly slice crosswise into half-moons. Halve, peel, and medium dice onion. Trim, peel, and grate carrot.\n\n3\n\nIn a medium bowl, combine cucumber, juice from half the lime, ¼ tsp sugar (½ tsp for 4 servings), and a pinch of salt. In a small bowl, combine mayonnaise, a pinch of garlic, a squeeze of lime juice, and as much sriracha as you’d like. Season with salt and pepper.\n\n4\n\nHeat a drizzle of oil in a large pan over medium-high heat. Add onion and cook, stirring, until softened, 4-5 minutes. Add beef, remaining garlic, and 2 tsp sugar (4 tsp for 4 servings). Cook, breaking up meat into pieces, until beef is browned and cooked through, 4-5 minutes. Stir in soy sauce. Turn off heat; taste and season with salt and pepper.\n\n5\n\nFluff rice with a fork; stir in lime zest and 1 TBSP butter. Divide rice between bowls. Arrange beef, grated carrot, and pickled cucumber on top. Top with a squeeze of lime juice. Drizzle with sriracha mayo.","id":"Beef-Banh-Mi-Bowls-with-Sriracha-Mayo,-Carrot-&-Pickled-Cucumber"},{"title":"masło&boczek","imageUrl":"","source":"","ingredients":"","directions":"","id":"masło&boczek"},{"title":"masło&","imageUrl":"","source":"","ingredients":"","directions":"","id":"masło&"},{"title":"Jerk chicken with rice & peas","imageUrl":"https://www.themealdb.com/images/media/meals/tytyxu1515363282.jpg","source":"https://www.youtube.com/watch?v=qfchrS2D_v4","ingredients":"Chicken Thighs: 12\nLime: 1/2 \nSpring Onions: 1  bunch\nGinger: 1 tbs chopped\nGarlic: 3 cloves\nOnion: 1/2 \nRed Chilli: 3 chopped\nThyme: 1/2 teaspoon\nLime: Juice of 1\nSoy Sauce: 2 tbs\nVegetable Oil: 2 tbs\nBrown Sugar: 3 tbs\nAllspice: 1 tbs\nBasmati Rice: 200g\nCoconut Milk: 400g\nSpring Onions: 1  bunch\nThyme: 2 sprigs\nGarlic: 2 cloves chopped\nAllspice: 1 tbs\nKidney Beans: 800g","directions":"To make the jerk marinade, combine all the ingredients in a food processor along with 1 tsp salt, and blend to a purée. If you’re having trouble getting it to blend, just keep turning off the blender, stirring the mixture, and trying again. Eventually it will start to blend up – don’t be tempted to add water, as you want a thick paste.\n\nTaste the jerk mixture for seasoning – it should taste pretty salty, but not unpleasantly, puckering salty. You can now throw in more chillies if it’s not spicy enough for you. If it tastes too salty and sour, try adding in a bit more brown sugar until the mixture tastes well balanced.\n\nMake a few slashes in the chicken thighs and pour the marinade over the meat, rubbing it into all the crevices. Cover and leave to marinate overnight in the fridge.\n\nIf you want to barbecue your chicken, get the coals burning 1 hr or so before you’re ready to cook. Authentic jerked meats are not exactly grilled as we think of grilling, but sort of smoke-grilled. To get a more authentic jerk experience, add some wood chips to your barbecue, and cook your chicken over slow, indirect heat for 30 mins. To cook in the oven, heat to 180C/160C fan/gas 4. Put the chicken pieces in a roasting tin with the lime halves and cook for 45 mins until tender and cooked through.\n\nWhile the chicken is cooking, prepare the rice & peas. Rinse the rice in plenty of cold water, then tip it into a large saucepan with all the remaining ingredients except the kidney beans. Season with salt, add 300ml cold water and set over a high heat. Once the rice begins to boil, turn it down to a medium heat, cover and cook for 10 mins.\n\nAdd the beans to the rice, then cover with a lid. Leave off the heat for 5 mins until all the liquid is absorbed. Squeeze the roasted lime over the chicken and serve with the rice & peas, and some hot sauce if you like it really spicy.","id":"Jerk-chicken-with-rice-&-peas"},{"title":"masło & grzanka","imageUrl":"","source":"","ingredients":"","directions":"","id":"masło-&-grzanka"},{"title":"kurczak'","imageUrl":"","source":"","ingredients":"","directions":"","id":"kurczak'"},{"title":"kurczaczek","imageUrl":"","source":"","ingredients":"","directions":"","id":"kurczaczek"},{"title":"kurczak1","imageUrl":"","source":"","ingredients":"","directions":"","id":"kurczak1"}]}